Grooming/src/Documents/ПоступлениеДенежныхСредств/ПоступлениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДенежныхСредств</name>
  <basedOn>Document.РеализацияТоваровИУслуг</basedOn>
  <registerRecords>AccumulationRegister.БезналичнаяОплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступленияДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровИУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Grooming/src/Enums/ОплатаДокумента/ОплатаДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОплатаДокумента</name>
  <enumValues>
    <name>НеОплачен</name>
  </enumValues>
  <enumValues>
    <name>ПолностьюОплачен</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноОплачен</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Enums/ВидыОперацийПоступленияДенег/ВидыОперацийПоступленияДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступленияДенег</name>
  <enumValues>
    <name>ОплатаОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеНаличныхВБанке</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПодотчетника</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Enums/ТипДенежныхСредств/ТипДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Клиент</name>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <basedOn>Document.ЗаписьКлиента</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаписьКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОплаты</name>
    <type>
      <types>EnumRef.ОплатаДокумента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Grooming/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиПолученияИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Питомцы</name>
    <attributes>
      <name>ВидПитомца</name>
      <type>
        <types>EnumRef.ВидыПитомцев</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаПитомца</name>
      <type>
        <types>CatalogRef.ПородыПитомцев</types>
      </type>
    </attributes>
    <attributes>
      <name>КличкаПитомца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияПитомца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Grooming/src/Documents/ПоступлениеДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Основание")
		И ЗначениеЗаполнено(Параметры.Основание)
		И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		
		СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Параметры.Основание);
		ПризнакОплаты = СтруктураОплаты.ПризнакОплаты;
		
		Если ПризнакОплаты = Перечисления.ОплатаДокумента.ПолностьюОплачен Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данный документ уже полностью оплачен. Ввод дополнительного документа оплаты не требуется!";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		Иначе
			Объект.СуммаДокумента = СтруктураОплаты.ОсталосьОплатить;
			ОсталосьОплатить = СтруктураОплаты.ОсталосьОплатить;
			Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
		КонецЕсли;
	КонецЕсли;
	
	
	ЗаполнитьРеквизитыФормы();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	Плательщик = Объект.Плательщик;
	ВидОперации = Объект.ВидОперации;
	ТипДенежныхСредств = Объект.ТипДенежныхСредств;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипДенежныхСредств = Перечисления.ТипДенежныхСредств.ПустаяСсылка();
		Если  НЕ Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя Тогда  
			Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ПустаяСсылка(); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость()
	СтрокаТипПлательщика = "";
	
	Если Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные") Тогда
		Элементы.Касса.Видимость = Истина;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
	ИначеЕсли Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Безналичные") Тогда
		Элементы.Касса.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Истина;
	КонецЕсли;
	
	
	Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь;          
		Элементы.Плательщик.Видимость = Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь;    
		Элементы.Плательщик.Видимость = Истина;
		Элементы.Касса.Видимость = Истина;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;                                                                                                             
		СтрокаТипПлательщика = "СправочникСсылка.Банки";  
	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь;    
		Элементы.Плательщик.Видимость = Истина;                                                                                                             
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
		
	Иначе
		Элементы.ДоговорКонтрагента.Видимость = Истина;         
		Элементы.Плательщик.Видимость = Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда         
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПлательщика));    
		ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
		Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;        
	КонецЕсли;  
	
	Если Элементы.ДоговорКонтрагента.Видимость = Истина
		И ЗначениеЗаполнено(Объект.Плательщик) Тогда
		Элементы.ДоговорКонтрагента.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	Запрос.Текст = "ВЫБРАТЬ
	|    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|    Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|    Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|    Контрагенты.Ссылка = &Плательщик";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
		И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
		возврат Ложь;
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции 


&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	Если Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные")
		И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ЭквайринговыйТерминал");
		ТекстВопроса = "При изменении реквизита ""Тип денежных средств"" будут очищены следующие данные:
		| - Эквайринговый терминал
		| Продолжить?";
		
		
	ИначеЕсли Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Безналичные")
		И ЗначениеЗаполнено(Объект.Касса) Тогда 
		МассивОчищаемыхРеквизитов.Добавить("Касса");
		ТекстВопроса = "При изменении реквизита ""Тип денежных средств"" будут очищены следующие данные:
		| - Касса
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств", ЭтаФорма, МассивОчищаемыхРеквизитов);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	Иначе
		ТипДенежныхСредств =  Объект.ТипДенежныхСредств;
		УстановитьВидимость(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств(Результат, 
	ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого Реквизит Из ДополнительныеПараметры Цикл
			Объект[Реквизит] = Неопределено;
		КонецЦикла;
		УстановитьВидимость();
		ТипДенежныхСредств =  Объект.ТипДенежныхСредств;
	Иначе
		Объект.ТипДенежныхСредств = ТипДенежныхСредств;
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	Если (Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника")
		ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке"))
		И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		
		ТекстВопроса = "При изменении реквизита ""Вид операции"" будут очищены следующие данные:
		| - Договор
		| Продолжить?";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОперации", ЭтаФорма, МассивОчищаемыхРеквизитов);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	Иначе
		ВидОперации =  Объект.ВидОперации;
		УстановитьВидимость();
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОперации(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого Реквизит Из ДополнительныеПараметры Цикл
			Объект[Реквизит] = Неопределено;
		КонецЦикла;
		УстановитьВидимость();
		ВидОперации =  Объект.ВидОперации;
	Иначе
		Объект.ВидОперации = ВидОперации;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	ЭтоПоставщик = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если  Не ЭтоПоставщик И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		
		ТекстВопроса = "При изменении реквизита ""Плательщик"" будут очищены следующие данные:
		| - Договор
		| Продолжить?";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПлательщик", ЭтаФорма, МассивОчищаемыхРеквизитов);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	Иначе
		Плательщик =  Объект.Плательщик;
		УстановитьВидимость();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПлательщик(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого Реквизит Из ДополнительныеПараметры Цикл
			Объект[Реквизит] = Неопределено;
		КонецЦикла;
		УстановитьВидимость();
		Плательщик =  Объект.Плательщик;
	Иначе
		Объект.Плательщик = Плательщик;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Если ОсталосьОплатить > 0 И Объект.СуммаДокумента > ОсталосьОплатить Тогда
        Объект.СуммаДокумента = ОсталосьОплатить;
    КонецЕсли;КонецПроцедуры
